src/cf/src/Documents/ПоступлениеИзПереработки/ПоступлениеИзПереработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеИзПереработки</name>
  <basedOn>Document.ПередачаВПереработку</basedOn>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВПереработке</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ПередачаВПереработку</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьУслуг</name>
    <comment>Без НДС; включается в себестоимость готовой продукции</comment>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДСУслуг</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДСУслуг</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧГотоваяПродукция</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПотерь</name>
      <type>
        <types>DefinedType.Процент</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/AccumulationRegisters/ТоварыВПереработке/ТоварыВПереработке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВПереработке</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Контрагент</name>
    <comment>Переработчик, у которого находятся товары</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПередачаВПереработку</name>
    <type>
      <types>DocumentRef.ПередачаВПереработку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ТоварыВНаличии/ТоварыВНаличии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВНаличии</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Catalogs/УпаковкиЕдиницыИзмерения/УпаковкиЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УпаковкиЕдиницыИзмерения</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Знаменатель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоУпаковок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МеждународноеСокращение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИзмеряемойВеличины</name>
    <type>
      <types>EnumRef.ТипыИзмеряемыхВеличин</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипУпаковки</name>
    <type>
      <types>EnumRef.ТипыУпаковокНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Числитель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <comment>Вес брутто</comment>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Высота</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Глубина</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлубинаЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ширина</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/cf/src/Documents/ПоступлениеИзПереработки/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Перечисляет печатные формы объекта.
// См. ПечатныеФормы.НоваяКоллекцияКомандПечати
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - пополняемая коллекция команд печати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	Команда = КомандыПечати.Добавить();
	Команда.ИмяМакета = "АктПриемки";
	Команда.Представление = НСтр("ru = 'Акт приёмки из переработки'; fr = 'Bon de réception de sous-traitance';
		|en = 'Receipt from processing act'; es = 'Acta de recepción de procesamiento'");

КонецПроцедуры

// Формирует запрошенные печатные формы.
// См. ПечатныеФормы.СформироватьПечатныеФормы
//
// Параметры:
//  МассивОбъектов        - Массив          - печатаемые объекты
//  ПараметрыПечати       - Структура       - параметры команды печати
//  КоллекцияПечатныхФорм - ТаблицаЗначений - заполняемая коллекция печатных форм
//  ОбъектыПечати         - СписокЗначений  - соответствие объектов областям печати
//  ПараметрыВывода       - Структура       - параметры окна печати
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если ПечатныеФормы.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПриемки") Тогда
		Таб = Новый ТабличныйДокумент;
		Для Каждого Док Из МассивОбъектов Цикл
			НомерСтрокиНачало = Таб.ВысотаТаблицы + 1;
			ПечатьАктПриемки(Док, Таб);
			ПечатныеФормы.ЗадатьОбластьПечати(Таб, НомерСтрокиНачало, ОбъектыПечати, Док);
		КонецЦикла;
		ПечатныеФормы.ВывестиТабличныйДокумент(КоллекцияПечатныхФорм, "АктПриемки",
			НСтр("ru = 'Акт приёмки из переработки'; fr = 'Bon de réception de sous-traitance';
			|en = 'Receipt from processing act'; es = 'Acta de recepción de procesamiento'"),
			Таб, "Документ.ПоступлениеИзПереработки.АктПриемки");
	КонецЕсли;

КонецПроцедуры

// Печать акта по документу в табличный документ (с разделителем страниц после каждого документа).
//
// Параметры:
//  Док - ДокументСсылка.ПоступлениеИзПереработки - печатаемый документ
//  Таб - ТабличныйДокумент - документ, в который выводится акт
//
Процедура ПечатьАктПриемки(Док, Таб) Экспорт
	Таб.ОтображатьСетку = Ложь;
	Таб.ОтображатьЗаголовки = Ложь;
	Таб.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	Таб.АвтоМасштаб = Истина;
	Таб.КлючПараметровПечати = "Параметры_печати_Документ_ПоступлениеИзПереработки_АктПриемки";
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Док,
		"Организация,МестоХранения,Контрагент,Ответственный");
	Макет = ПечатныеФормы.МакетПечатнойФормы("Документ.ПоступлениеИзПереработки.АктПриемки");
	Область = Макет.ПолучитьОбласть("Заголовок");
	ТекстЗаголовка = НСтр("ru = 'Акт приёмки из переработки'; fr = 'Bon de réception de sous-traitance';
		|en = 'Receipt from processing act'; es = 'Acta de recepción de procesamiento'");
	Область.Параметры.ТекстЗаголовка = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, ТекстЗаголовка);
	Таб.Вывести(Область);
	Область = Макет.ПолучитьОбласть("РеквизитыОрганизации");
	Область.Параметры.ПредставлениеОрганизации = Реквизиты.Организация;
	Область.Параметры.ПредставлениеСклада = Реквизиты.МестоХранения;
	Область.Параметры.ПредставлениеКонтрагента = Реквизиты.Контрагент;
	Таб.Вывести(Область);
	Подзаголовок = НСтр("ru = 'Списано сырьё у переработчика'; fr = 'Matières premières consommées chez le sous-traitant';
		|en = 'Raw materials consumed at the processor'; es = 'Materias primas consumidas en el procesador'");
	ВывестиТаблицу(Таб, Макет, ТаблицаСырья(Док), Подзаголовок, Истина);
	Подзаголовок = НСтр("ru = 'Получена продукция'; fr = 'Produits reçus'; en = 'Products received'; es = 'Productos recibidos'");
	ВывестиТаблицу(Таб, Макет, ТаблицаПродукции(Док), Подзаголовок, Истина);
	Область = Макет.ПолучитьОбласть("Подписи");
	Область.Параметры.ОтветственныйПредставление = Реквизиты.Ответственный;
	Таб.Вывести(Область);
	Таб.ВывестиГоризонтальныйРазделительСтраниц();
	ИмяФайла = НСтр("ru = 'Акт приёмки'; fr = 'Bon de réception'; en = 'Receipt act'; es = 'Acta de recepción'");
	Таб.ИспользуемоеИмяФайла = РаботаСДокументами.КраткоеПредставлениеДокумента(Док, ИмяФайла);
КонецПроцедуры

// Сырьё, списываемое у переработчика под принимаемую продукцию, - одно правило на обработку заполнения и
// на пересчёт в форме документа.
//
// До S5-B в строки уходил ВЕСЬ остаток передачи у переработчика, и частичная приёмка списывала всё сырьё
// под неполный выпуск. Теперь расход считается по технологическим картам принимаемой продукции
// пропорционально принятому количеству, с учётом процента потерь строки продукции.
//
// Правила, каждое со своей причиной:
//  - расход - лимит на ГРУППУ строк остатка «материал + характеристика», а не на строку: в карте нет
//    серии, а остаток ведётся по «номенклатура + характеристика + серия + партия», и поштучное
//    Мин(Остаток, Расход) списало бы материал, лежащий тремя сериями, втрое;
//  - приоритет групп: сначала точные «материал + характеристика», затем группа с пустой характеристикой в
//    карте - по тому, что осталось НЕ СПИСАННЫМ в строках. Двойного лимита при этом не возникает: каждая
//    строка остатка отдаёт не больше своего количества, сколько бы групп на неё ни претендовало;
//  - порог: если остаток группы выше расхода не больше, чем на расчётные потери, в строки идёт весь
//    остаток группы - крошка не висит у переработчика, её стоимость входит в себестоимость принятого.
//    Дочистка ограничена партиями передачи-основания самим ОТБОРОМ остатков (см. ОстаткиПередачи):
//    иначе по заказу с двумя передачами, вторая из которых ещё в работе, она утащила бы сырьё, физически
//    лежащее у переработчика;
//  - процент потерь не заполнен (в карте его нет) - порог равен нулю, и крошка висит, как до S5-B;
//  - доработка «продукция = сырьё» (перешив, покраска): позиция продукции, которая сама лежит у
//    переработчика, расходуется по принятому количеству; её собственная карта к ней не применяется, а
//    расход по картам ДРУГОЙ принимаемой продукции, где она материал, к этому прибавляется. Без правила
//    документ заполнился бы пустым, а себестоимость свелась к услугам;
//  - принимать нечего (продукции нет или её количество нулевое) - списывать нечего, и строки пусты;
//  - карт нет ни у одной позиции продукции - берётся весь остаток, поведение до S5-B. Если карта есть
//    хотя бы у одной, позиция остатка вне карт в строки не попадает: пользователь добавляет её руками.
//
// Параметры:
//  Передача    - ДокументСсылка.ПередачаВПереработку - передача-основание.
//  Документ    - ДокументОбъект.ПоступлениеИзПереработки, ДанныеФормыСтруктура - заполняемый документ;
//                берутся Ссылка, Дата и Контрагент.
//  ТЗПродукция - ТаблицаЗначений - строки ТЧГотоваяПродукция, колонки Номенклатура, Характеристика,
//                Количество, КоличествоУпаковок, ПроцентПотерь.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки ТЧТовары: Номенклатура, Характеристика, Серия, Упаковка,
//                    КоличествоУпаковок, Количество. Пустая - списывать нечего.
//
Функция СырьеПоПродукции(Передача, Документ, ТЗПродукция) Экспорт

	Результат = НоваяТаблицаСырья();
	Если ПринимаемоеКоличество(ТЗПродукция) <= 0 Тогда
		// Принимать нечего - списывать нечего. Отличать этот случай от «карт нет ни у одной позиции»
		// обязательно: иначе второе поступление по УЖЕ ПОЛНОСТЬЮ ПРИНЯТОЙ передаче (ожидаемая продукция
		// вычтена до нуля и строки удалены) свалилось бы в ветку «весь остаток» и забрало остаток сырья
		// под нулевую продукцию. Провести такой документ значит списать сырьё с его стоимостью и не
		// оприходовать ничего - стоимость исчезает из учёта. До S5-B путь был недостижим: полная приёмка
		// не оставляла остатка, пропорциональный расход его создаёт.
		Возврат Результат;
	КонецЕсли;
	ТЗОстатки = ОстаткиПередачи(Передача, Документ.Контрагент, ГраницаОстатков(Документ));
	Если ТЗОстатки.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	Группы = ГруппыРасхода(ТЗПродукция, ТЗОстатки, Документ.Дата);
	Если Группы.Количество() = 0 Тогда
		// Ни у одной принимаемой позиции карты нет и ни одна не лежит у переработчика сама: правила
		// расчёта нет, и в строки идёт весь остаток передачи - поведение до S5-B.
		Для Каждого Стр Из ТЗОстатки Цикл
			Стр.Списать = Стр.Количество;
		КонецЦикла;
	Иначе
		РаспределитьРасходПоОстаткам(ТЗОстатки, Группы);
	КонецЕсли;
	Единицы = ЕдиницыНоменклатуры(ТЗОстатки.ВыгрузитьКолонку("Номенклатура"));
	Для Каждого Стр Из ТЗОстатки Цикл
		Если Стр.Списать <= 0 Тогда
			Продолжить;
		КонецЕсли;
		НоваяСтрока = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр, "Номенклатура, Характеристика, Серия");
		НоваяСтрока.Упаковка = Единицы[Стр.Номенклатура];
		НоваяСтрока.Количество = Стр.Списать;
		НоваяСтрока.КоличествоУпаковок = Стр.Списать;
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Перезаполняет строки сырья документа расходом по принимаемой продукции - одна точка на обработку
// заполнения, пересчёт в форме и сценарий уровня 3. Дублировать эти три строки по местам вызова нельзя:
// путь формы перестал бы проверяться сценарием, а расхождение реализаций не поймал бы ни один гейт.
//
// Параметры:
//  Документ - ДокументОбъект.ПоступлениеИзПереработки, ДанныеФормыСтруктура - заполняемый документ.
//  Передача - ДокументСсылка.ПередачаВПереработку - передача-основание.
//
Процедура ЗаполнитьСырье(Документ, Передача) Экспорт

	Документ.ТЧТовары.Загрузить(СырьеПоПродукции(Передача, Документ, Документ.ТЧГотоваяПродукция.Выгрузить()));
	Для Каждого Стр Из Документ.ТЧТовары Цикл
		Стр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Документ.ТЧТовары);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Момент, на который читаются остатки сырья у переработчика.
//
// Записанный документ - граница «исключая» его собственный момент: свои движения в остаток входить не должны
// (см. РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента, там же учтён сдвиг даты).
//
// У НОВОГО документа своих движений нет, и остатки берутся на его собственную дату включительно, а не на
// текущий момент сеанса. Момент сеанса отсекал бы приход передачи у документа, датированного позже «сейчас»,
// и заполнение возвращало бы пустую табличную часть (поймано сценарием АРМПереработка). Брать
// Новый Граница(МоментВремени(), Исключая) нельзя по обратной причине: у незаписанного объекта момент
// строится с пустой ссылкой, она сортируется раньше любой реальной, и граница отсекла бы приход передачи
// того же дня.
//
// Параметры:
//  Документ - ДокументОбъект.ПоступлениеИзПереработки, ДанныеФормыСтруктура - заполняемый документ.
//
// Возвращаемое значение:
//  Граница, Дата - момент получения остатков.
//
Функция ГраницаОстатков(Документ)

	Если ЗначениеЗаполнено(Документ.Ссылка) Тогда
		Возврат РаботаСДокументамиВызовСервера.ПолучитьГраницуДокумента(Документ);
	КонецЕсли;
	Возврат ?(ЗначениеЗаполнено(Документ.Дата), Новый Граница(Документ.Дата, ВидГраницы.Включая),
		ТекущаяДатаСеанса());

КонецФункции

// Остатки сырья ПЕРЕДАЧИ-ОСНОВАНИЯ у переработчика на момент документа, свёрнутые до ключа строки
// документа. Партии сворачиваются: в строке документа партии нет, списание разбирает их по FIFO при
// проведении.
//
// Отбор по измерению ПередачаВПереработку - это и есть выполнение правила «порог дочистки применяется
// только к партиям передачи-основания» (находка П-14 гейта плана): партий чужой, ещё не вернувшейся
// передачи в таблице просто нет, и дочистить их нечем. Правило держится ОТБОРОМ, а не проверкой ниже по
// коду - проверка на данных, которых не бывает, не проверяется ничем и при снятии отбора молча
// разошлась бы с ним. Если путь заполнения когда-нибудь расширится до заказа, правило придётся вернуть
// сюда явно И покрыть сценарием.
//
// Порядок строк - от ПолучитьОстатки, то есть по дате партии; Свернуть сохраняет порядок первого
// появления группы, и FIFO не теряется.
//
// Параметры:
//  Передача   - ДокументСсылка.ПередачаВПереработку - передача-основание.
//  Контрагент - СправочникСсылка.Контрагенты - переработчик.
//  Граница    - Граница, Дата - момент остатков.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки Номенклатура, Характеристика, Серия, Количество и Списать (ноль).
//
Функция ОстаткиПередачи(Передача, Контрагент, Граница)

	Отбор = Новый Структура("ПередачаВПереработку", Передача);
	ТЗ = РегистрыНакопления.ТоварыВПереработке.ПолучитьОстатки(Контрагент, Граница, Отбор);
	ТЗ.Свернуть("Номенклатура, Характеристика, Серия", "Количество");
	Индекс = ТЗ.Количество() - 1;
	Пока Индекс >= 0 Цикл
		Если ТЗ[Индекс].Количество <= 0 Тогда
			ТЗ.Удалить(Индекс);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	ТЗ.Колонки.Добавить("Списать", Новый ОписаниеТипов("Число"));
	Возврат ТЗ;

КонецФункции

// Принимаемое количество продукции всего. Ноль - принимать нечего.
//
// Параметры:
//  ТЗПродукция - ТаблицаЗначений - см. СырьеПоПродукции.
//
// Возвращаемое значение:
//  Число - итог количества.
//
Функция ПринимаемоеКоличество(ТЗПродукция)

	Итог = 0;
	Для Каждого Стр Из ТЗПродукция Цикл
		Итог = Итог + Макс(0, Стр.Количество);
	КонецЦикла;
	Возврат Итог;

КонецФункции

// Группы расхода по материалам: лимит списания и порог дочистки на «материал + характеристика».
//
// Приоритет - заполненная характеристика впереди пустой (см. СырьеПоПродукции).
//
// Доработка «продукция = сырьё». Позиция продукции, которая сама лежит у переработчика по этой передаче,
// расходуется по ПРИНЯТОМУ количеству, и её собственная карта к ней не применяется - поэтому такие строки
// исключаются из входа РасходПоКартам целиком. Иначе по передаче, где отдали и изделие на перешив, и ткань
// на пошив, приёмка изделий списала бы вдобавок ткань по карте изделия: вдвое больше принятого, с
// завышенной себестоимостью и пропавшей с остатка тканью.
//
// При этом лимит самосырья ПРИБАВЛЯЕТСЯ к лимиту карт, а не замещает его: та же позиция может быть
// материалом в карте ДРУГОЙ принимаемой продукции, и это не редкость - после S4-B полуфабрикат штатно
// лежит у переработчика. Замещение недосписало бы его под изделие и занизило себестоимость изделия, не
// выдав ни одного сообщения: недостачи в проведении при этом нет.
//
// Параметры:
//  ТЗПродукция - ТаблицаЗначений - см. СырьеПоПродукции.
//  ТЗОстатки   - ТаблицаЗначений - см. ОстаткиПередачи.
//  Дата        - Дата - момент среза технологических карт.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки Номенклатура, Характеристика, Лимит, Порог, Приоритет; упорядочена по
//                    приоритету. Пустая - правила расчёта нет.
//
Функция ГруппыРасхода(ТЗПродукция, ТЗОстатки, Дата)

	ПоКартам = ТЗПродукция.Скопировать();
	Самосырье = НоваяТаблицаГрупп();
	Индекс = ПоКартам.Количество() - 1;
	Пока Индекс >= 0 Цикл
		Стр = ПоКартам[Индекс];
		Отбор = Новый Структура("Номенклатура, Характеристика", Стр.Номенклатура, Стр.Характеристика);
		Если ТЗОстатки.НайтиСтроки(Отбор).Количество() > 0 Тогда
			Группа = ГруппаРасхода(Самосырье, Стр.Номенклатура, Стр.Характеристика);
			Доля = Макс(0, Стр.ПроцентПотерь) / РаботаСДокументамиКлиентСервер.СтоПроцентов();
			Группа.Лимит = Группа.Лимит + Стр.Количество * (1 + Доля);
			Группа.Порог = Группа.Порог + Стр.Количество * Доля;
			ПоКартам.Удалить(Индекс);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	Расход = ТехнологическиеКарты.РасходПоКартам(ПоКартам, Дата);
	Группы = НоваяТаблицаГрупп();
	Для Каждого Стр Из Расход.Материалы Цикл
		Группа = ГруппаРасхода(Группы, Стр.Номенклатура, Стр.Характеристика);
		Группа.Лимит = Стр.Количество;
	КонецЦикла;
	Для Каждого Стр Из Расход.Потери Цикл
		Группа = ГруппаРасхода(Группы, Стр.Номенклатура, Стр.Характеристика);
		Группа.Порог = Стр.Количество;
	КонецЦикла;
	Разрядность = ТехнологическиеКарты.РазрядностьКоличества();
	Для Каждого Стр Из Самосырье Цикл
		Группа = ГруппаРасхода(Группы, Стр.Номенклатура, Стр.Характеристика);
		Группа.Лимит = Группа.Лимит + ВычисленияКлиентСервер.ОкрВверх(Стр.Лимит, Разрядность);
		Группа.Порог = Группа.Порог + Стр.Порог;
	КонецЦикла;
	Группы.Сортировать("Приоритет");
	Возврат Группы;

КонецФункции

// Строка группы расхода по материалу и характеристике; создаётся, если её ещё нет.
//
// Параметры:
//  Группы         - ТаблицаЗначений - см. НоваяТаблицаГрупп.
//  Номенклатура   - СправочникСсылка.Номенклатура - материал.
//  Характеристика - СправочникСсылка.ХарактеристикиНоменклатуры - характеристика материала в карте.
//
// Возвращаемое значение:
//  СтрокаТаблицыЗначений - строка группы.
//
Функция ГруппаРасхода(Группы, Номенклатура, Характеристика)

	Отбор = Новый Структура("Номенклатура, Характеристика", Номенклатура, Характеристика);
	Найденные = Группы.НайтиСтроки(Отбор);
	Если Найденные.Количество() > 0 Тогда
		Возврат Найденные[0];
	КонецЕсли;
	Группа = Группы.Добавить();
	Группа.Номенклатура = Номенклатура;
	Группа.Характеристика = Характеристика;
	Группа.Приоритет = ?(ЗначениеЗаполнено(Характеристика), 0, 1);
	Возврат Группа;

КонецФункции

// Раскладывает лимиты групп по строкам остатка: колонка Списать.
//
// Параметры:
//  ТЗОстатки - ТаблицаЗначений - см. ОстаткиПередачи; изменяется.
//  Группы    - ТаблицаЗначений - см. ГруппыРасхода.
//
Процедура РаспределитьРасходПоОстаткам(ТЗОстатки, Группы)

	Для Каждого Группа Из Группы Цикл
		Строки = СтрокиГруппы(ТЗОстатки, Группа);
		Если Строки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		// Остаток группы - то, что ещё НЕ списано предыдущими группами. Учёт по остатку строки, а не флагом
		// «строка занята»: флаг отдавал точной группе всю строку целиком, даже если её лимита хватало на
		// часть, и группа с пустой характеристикой оставалась без строк - расход по карте, где материал
		// указан без характеристики, не списывался вовсе. Двойного лимита учёт по остатку не даёт: строка
		// отдаёт не больше своего количества, сколько бы групп на неё ни претендовало.
		ОстатокГруппы = 0;
		Для Каждого Стр Из Строки Цикл
			ОстатокГруппы = ОстатокГруппы + Стр.Количество - Стр.Списать;
		КонецЦикла;
		Лимит = Мин(Группа.Лимит, ОстатокГруппы);
		Если ОстатокГруппы - Группа.Лимит <= Группа.Порог Тогда
			// Дочистка: крошка ниже расчётных потерь уходит в это же поступление. В таблице лежат только
			// партии передачи-основания (см. ОстаткиПередачи), поэтому чужую передачу она не трогает.
			Лимит = ОстатокГруппы;
		КонецЕсли;
		Для Каждого Стр Из Строки Цикл
			Если Лимит <= 0 Тогда
				Прервать;
			КонецЕсли;
			Списать = Мин(Лимит, Стр.Количество - Стр.Списать);
			Стр.Списать = Стр.Списать + Списать;
			Лимит = Лимит - Списать;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры

// Строки остатка группы, в которых ещё есть что списывать, в порядке таблицы - то есть по дате партии
// (FIFO). Группа с пустой характеристикой берёт строки с ЛЮБОЙ характеристикой: ей достаётся то, что не
// списала точная группа.
//
// Параметры:
//  ТЗОстатки - ТаблицаЗначений - см. ОстаткиПередачи.
//  Группа    - СтрокаТаблицыЗначений - см. ГруппыРасхода.
//
// Возвращаемое значение:
//  Массив из СтрокаТаблицыЗначений - строки остатка в порядке разбора.
//
Функция СтрокиГруппы(ТЗОстатки, Группа)

	Результат = Новый Массив;
	ТочнаяХарактеристика = ЗначениеЗаполнено(Группа.Характеристика);
	Для Каждого Стр Из ТЗОстатки Цикл
		Если Стр.Списать >= Стр.Количество Или Стр.Номенклатура <> Группа.Номенклатура Тогда
			Продолжить;
		КонецЕсли;
		Если ТочнаяХарактеристика И Стр.Характеристика <> Группа.Характеристика Тогда
			Продолжить;
		КонецЕсли;
		Результат.Добавить(Стр);
	КонецЦикла;
	Возврат Результат;

КонецФункции

// Пустая таблица групп расхода. См. ГруппыРасхода.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки Номенклатура, Характеристика, Лимит, Порог, Приоритет.
//
Функция НоваяТаблицаГрупп()

	ТипЧисло = Новый ОписаниеТипов("Число");
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТЗ.Колонки.Добавить("Лимит", ТипЧисло);
	ТЗ.Колонки.Добавить("Порог", ТипЧисло);
	ТЗ.Колонки.Добавить("Приоритет", ТипЧисло);
	Возврат ТЗ;

КонецФункции

// Пустая таблица строк сырья документа. См. СырьеПоПродукции.
//
// Возвращаемое значение:
//  ТаблицаЗначений - колонки ТЧТовары без КодСтроки: его присваивает загружающая сторона.
//
Функция НоваяТаблицаСырья()

	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТЗ.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТЗ.Колонки.Добавить("Серия", Новый ОписаниеТипов("СправочникСсылка.СерииНоменклатуры"));
	ТЗ.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	ТипЧисло = Новый ОписаниеТипов("Число");
	ТЗ.Колонки.Добавить("КоличествоУпаковок", ТипЧисло);
	ТЗ.Колонки.Добавить("Количество", ТипЧисло);
	Возврат ТЗ;

КонецФункции

// Соответствие номенклатура - единица хранения, одним запросом по списку.
//
// Параметры:
//  Номенклатура - Массив из СправочникСсылка.Номенклатура - позиции.
//
// Возвращаемое значение:
//  Соответствие - ключ СправочникСсылка.Номенклатура, значение СправочникСсылка.УпаковкиЕдиницыИзмерения.
//
Функция ЕдиницыНоменклатуры(Номенклатура)

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Номенклатура.Ссылка КАК Номенклатура,
	                      |	Номенклатура.Единица КАК Единица
	                      |ИЗ
	                      |	Справочник.Номенклатура КАК Номенклатура
	                      |ГДЕ
	                      |	Номенклатура.Ссылка В (&Номенклатура)");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Результат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.Номенклатура, Выборка.Единица);
	КонецЦикла;
	Возврат Результат;

КонецФункции

Процедура ВывестиТаблицу(Таб, Макет, ТЗ, Подзаголовок, СИтогами)
	// Таблица строк с шапкой; при СИтогами - итог и сумма прописью по себестоимости из движений.
	Область = Макет.ПолучитьОбласть("Подзаголовок");
	Область.Параметры.Подзаголовок = Подзаголовок;
	Таб.Вывести(Область);
	Таб.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицы"));
	Область = Макет.ПолучитьОбласть("Строка");
	Для Каждого Стр Из ТЗ Цикл
		Область.Параметры.Заполнить(Стр);
		Область.Параметры.Товар = ОбщегоНазначенияКлиентСервер.ПредставлениеНоменклатуры(Стр.Номенклатура,
			Стр.Характеристика, , Истина);
		Если СИтогами Тогда
			Область.Параметры.Цена = ?(Стр.Количество = 0, 0, Окр(Стр.Сумма / Стр.Количество, РазрядностьСуммы()));
		Иначе
			Область.Параметры.Цена = "";
			Область.Параметры.Сумма = "";
		КонецЕсли;
		Таб.Вывести(Область);
	КонецЦикла;
	Если Не СИтогами Тогда
		Возврат;
	КонецЕсли;
	Сумма = ТЗ.Итог("Сумма");
	Область = Макет.ПолучитьОбласть("Итого");
	Область.Параметры.Всего = Сумма;
	Таб.Вывести(Область);
	Область = Макет.ПолучитьОбласть("СуммаПрописью");
	Область.Параметры.СуммаПрописью = ПечатныеФормы.СуммаПрописьюВВалютеУчета(Сумма);
	Таб.Вывести(Область);
КонецПроцедуры

Функция РазрядностьСуммы()
	Возврат 2;
КонецФункции

Функция ТаблицаСырья(Док)
	// Сырьё с себестоимостью списания у переработчика.
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Движения.Номенклатура КАК Номенклатура,
	                      |	Движения.Характеристика КАК Характеристика,
	                      |	СУММА(Движения.Количество) КАК Количество,
	                      |	СУММА(Движения.Сумма) КАК Сумма
	                      |ПОМЕСТИТЬ ВТДвижения
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыВПереработке КАК Движения
	                      |ГДЕ
	                      |	Движения.Регистратор = &Док
	                      |	И Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Движения.Номенклатура,
	                      |	Движения.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТЧ.НомерСтроки КАК НомерСтроки,
	                      |	СправочникНоменклатура.Артикул КАК Артикул,
	                      |	ТЧ.Номенклатура КАК Номенклатура,
	                      |	ТЧ.Характеристика КАК Характеристика,
	                      |	ТЧ.КоличествоУпаковок КАК КоличествоМест,
	                      |	ВЫБОР
	                      |		КОГДА ТЧ.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	                      |			ТОГДА СправочникНоменклатура.Единица
	                      |		ИНАЧЕ ТЧ.Упаковка
	                      |	КОНЕЦ КАК ЕдиницаИзмерения,
	                      |	ТЧ.Количество КАК Количество,
	                      |	СправочникНоменклатура.Единица КАК ЕдиницаХранения,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(ВТДвижения.Количество, 0) = 0
	                      |			ТОГДА 0
	                      |		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТДвижения.Сумма, 0) / ВТДвижения.Количество * ТЧ.Количество КАК ЧИСЛО(15, 2))
	                      |	КОНЕЦ КАК Сумма
	                      |ИЗ
	                      |	Документ.ПоступлениеИзПереработки.ТЧТовары КАК ТЧ
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	                      |		ПО ТЧ.Номенклатура = СправочникНоменклатура.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТДвижения КАК ВТДвижения
	                      |		ПО ТЧ.Номенклатура = ВТДвижения.Номенклатура
	                      |			И ТЧ.Характеристика = ВТДвижения.Характеристика
	                      |ГДЕ
	                      |	ТЧ.Ссылка = &Док
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	НомерСтроки");
	Запрос.УстановитьПараметр("Док", Док);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ТаблицаПродукции(Док)
	// Продукция с себестоимостью оприходования на склад.
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Движения.Номенклатура КАК Номенклатура,
	                      |	Движения.Характеристика КАК Характеристика,
	                      |	СУММА(Движения.Количество) КАК Количество,
	                      |	СУММА(Движения.Сумма) КАК Сумма
	                      |ПОМЕСТИТЬ ВТДвижения
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыВНаличии КАК Движения
	                      |ГДЕ
	                      |	Движения.Регистратор = &Док
	                      |	И Движения.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Движения.Номенклатура,
	                      |	Движения.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТЧ.НомерСтроки КАК НомерСтроки,
	                      |	СправочникНоменклатура.Артикул КАК Артикул,
	                      |	ТЧ.Номенклатура КАК Номенклатура,
	                      |	ТЧ.Характеристика КАК Характеристика,
	                      |	ТЧ.КоличествоУпаковок КАК КоличествоМест,
	                      |	ВЫБОР
	                      |		КОГДА ТЧ.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка)
	                      |			ТОГДА СправочникНоменклатура.Единица
	                      |		ИНАЧЕ ТЧ.Упаковка
	                      |	КОНЕЦ КАК ЕдиницаИзмерения,
	                      |	ТЧ.Количество КАК Количество,
	                      |	СправочникНоменклатура.Единица КАК ЕдиницаХранения,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(ВТДвижения.Количество, 0) = 0
	                      |			ТОГДА 0
	                      |		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ВТДвижения.Сумма, 0) / ВТДвижения.Количество * ТЧ.Количество КАК ЧИСЛО(15, 2))
	                      |	КОНЕЦ КАК Сумма
	                      |ИЗ
	                      |	Документ.ПоступлениеИзПереработки.ТЧГотоваяПродукция КАК ТЧ
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
	                      |		ПО ТЧ.Номенклатура = СправочникНоменклатура.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТДвижения КАК ВТДвижения
	                      |		ПО ТЧ.Номенклатура = ВТДвижения.Номенклатура
	                      |			И ТЧ.Характеристика = ВТДвижения.Характеристика
	                      |ГДЕ
	                      |	ТЧ.Ссылка = &Док
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	НомерСтроки");
	Запрос.УстановитьПараметр("Док", Док);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

#КонецОбласти
